IDEA StatiCa Open Model
MaterialStrength Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Strength of material with specific thickness range
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Material.MaterialStrength
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MaterialStrength : OpenObject
Public Class MaterialStrength
	Inherits OpenObject
public ref class MaterialStrength : public OpenObject
The MaterialStrength type exposes the following members.
Constructors
Name | Description
MaterialStrength
Initializes a new instance of the MaterialStrength class
Top
Properties
Name | Description
Fu
 Tension strength
Fy
 Yield strength
MaxThickness
 higher value of the thickness range
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace